{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.2.0", "signature": {"inputs": {"unknown:0": {"name": "unknown:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "66150"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1024"}, {"size": "1"}, {"size": "513"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_12/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_13/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/All", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "PartitionedCall/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_8/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution_1/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1024"}, {"size": "1"}, {"size": "513"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_5/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_14/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_15/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "513"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_22/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_7", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_Div_26_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "66150"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceMin_0", "op": "Min", "input": ["unknown", "PartitionedCall/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sub_1", "op": "Sub", "input": ["unknown", "PartitionedCall/onnx_tf_prefix_ReduceMin_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceMax_2", "op": "Max", "input": ["PartitionedCall/onnx_tf_prefix_Sub_1", "PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Div_3", "op": "RealDiv", "input": ["PartitionedCall/onnx_tf_prefix_Sub_1", "PartitionedCall/onnx_tf_prefix_ReduceMax_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Mul_5", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Div_3", "PartitionedCall/onnx_tf_prefix_Constant_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sub_7", "op": "Sub", "input": ["PartitionedCall/onnx_tf_prefix_Mul_5", "PartitionedCall/onnx_tf_prefix_Constant_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_8", "op": "ExpandDims", "input": ["PartitionedCall/onnx_tf_prefix_Sub_7", "PartitionedCall/onnx_tf_prefix_Unsqueeze_8/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/cond", "op": "StatelessIf", "input": ["PartitionedCall/All", "PartitionedCall/Const_2", "PartitionedCall/onnx_tf_prefix_Unsqueeze_8"], "attr": {"output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}]}]}}, "Tout": {"list": {"type": ["DT_FLOAT"]}}, "Tcond": {"type": "DT_BOOL"}, "_lower_using_switch_merge": {"b": false}, "then_branch": {"func": {"name": "__inference_cond_true_41_174"}}, "_read_only_resource_inputs": {"list": {}}, "else_branch": {"func": {"name": "__inference_cond_false_42_62"}}, "Tin": {"list": {"type": ["DT_INT32", "DT_FLOAT"]}}}}, {"name": "PartitionedCall/transpose_1", "op": "Transpose", "input": ["PartitionedCall/cond", "PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_4", "op": "Transpose", "input": ["PartitionedCall/cond", "PartitionedCall/transpose_4/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/convolution/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/transpose_1", "PartitionedCall/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution_1/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/transpose_4", "PartitionedCall/convolution_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/convolution", "op": "Conv2D", "input": ["PartitionedCall/convolution/ExpandDims", "PartitionedCall/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "512", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "PartitionedCall/convolution_1", "op": "Conv2D", "input": ["PartitionedCall/convolution_1/ExpandDims", "PartitionedCall/convolution_1/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "512", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/convolution/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/convolution"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/convolution_1/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/convolution_1"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/transpose_2", "op": "Transpose", "input": ["PartitionedCall/convolution/Squeeze", "PartitionedCall/transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_5", "op": "Transpose", "input": ["PartitionedCall/convolution_1/Squeeze", "PartitionedCall/transpose_5/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_12", "op": "ExpandDims", "input": ["PartitionedCall/transpose_2", "PartitionedCall/onnx_tf_prefix_Unsqueeze_12/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_14", "op": "ExpandDims", "input": ["PartitionedCall/transpose_5", "PartitionedCall/onnx_tf_prefix_Unsqueeze_14/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_13", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_Unsqueeze_12", "PartitionedCall/onnx_tf_prefix_Transpose_13/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_15", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_Unsqueeze_14", "PartitionedCall/onnx_tf_prefix_Transpose_15/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Pow_16", "op": "Square", "input": ["PartitionedCall/onnx_tf_prefix_Transpose_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Pow_17", "op": "Square", "input": ["PartitionedCall/onnx_tf_prefix_Transpose_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_18", "op": "Add", "input": ["PartitionedCall/onnx_tf_prefix_Pow_16", "PartitionedCall/onnx_tf_prefix_Pow_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Squeeze_19", "op": "Squeeze", "input": ["PartitionedCall/onnx_tf_prefix_Add_18"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Squeeze_20", "op": "Squeeze", "input": ["PartitionedCall/onnx_tf_prefix_Squeeze_19"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_21", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Squeeze_20", "unknown_4"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_22", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_21", "PartitionedCall/onnx_tf_prefix_Transpose_22/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Max", "op": "Max", "input": ["PartitionedCall/onnx_tf_prefix_Transpose_22", "PartitionedCall/Const_7"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/clip_by_value/Minimum", "op": "Minimum", "input": ["PartitionedCall/onnx_tf_prefix_Transpose_22", "PartitionedCall/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/clip_by_value", "op": "Maximum", "input": ["PartitionedCall/clip_by_value/Minimum", "PartitionedCall/clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Log_24", "op": "Log", "input": ["PartitionedCall/clip_by_value"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Div_26", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Log_24", "ConstantFolding/PartitionedCall/onnx_tf_prefix_Div_26_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_Div_26"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_cond_false_42_62", "inputArg": [{"name": "cond_gatherv2_const_2", "type": "DT_INT32"}, {"name": "cond_slice_onnx_tf_prefix_unsqueeze_8", "type": "DT_FLOAT"}], "outputArg": [{"name": "cond_identity", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_cond_false_42_62/cond/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_cond_false_42_62/cond/range_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "__inference_cond_false_42_62/cond/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_cond_false_42_62/cond/range", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "__inference_cond_false_42_62/cond/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "cond/GatherV2_1", "op": "GatherV2", "input": ["cond_gatherv2_const_2", "__inference_cond_false_42_62/cond/range_1:output:0", "__inference_cond_false_42_62/cond/GatherV2_1/axis:output:0"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "cond/GatherV2", "op": "GatherV2", "input": ["cond_gatherv2_const_2", "__inference_cond_false_42_62/cond/range:output:0", "__inference_cond_false_42_62/cond/GatherV2/axis:output:0"], "attr": {"Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "cond/add", "op": "AddV2", "input": ["__inference_cond_false_42_62/cond/Shape:output:0", "cond/GatherV2_1:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "cond/Neg", "op": "Neg", "input": ["cond/GatherV2:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "cond/sub", "op": "AddV2", "input": ["cond/add:z:0", "cond/GatherV2:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "cond/Slice", "op": "Slice", "input": ["cond_slice_onnx_tf_prefix_unsqueeze_8", "cond/Neg:y:0", "cond/sub:z:0"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}], "ret": {"cond_identity": "cond/Slice:output:0"}, "argAttr": {"0": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "6"}]}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "1"}, {"size": "66150"}]}]}}}}}}, {"signature": {"name": "__inference_cond_true_41_174", "inputArg": [{"name": "cond_reshape_const_2", "type": "DT_INT32"}, {"name": "cond_onnx_tf_prefix_pad_9_onnx_tf_prefix_unsqueeze_8", "type": "DT_FLOAT"}], "outputArg": [{"name": "cond_identity", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_cond_true_41_174/cond/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_cond_true_41_174/cond/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "cond/Reshape", "op": "Reshape", "input": ["cond_reshape_const_2", "__inference_cond_true_41_174/cond/Reshape/shape:output:0"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "cond/transpose", "op": "Transpose", "input": ["cond/Reshape:output:0", "__inference_cond_true_41_174/cond/transpose/perm:output:0"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "cond/onnx_tf_prefix_Pad_9", "op": "MirrorPad", "input": ["cond_onnx_tf_prefix_pad_9_onnx_tf_prefix_unsqueeze_8", "cond/transpose:y:0"], "attr": {"T": {"type": "DT_FLOAT"}, "mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}}}], "ret": {"cond_identity": "cond/onnx_tf_prefix_Pad_9:output:0"}, "argAttr": {"0": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "6"}]}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "1"}, {"size": "66150"}]}]}}}}}}]}, "versions": {"producer": 561, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "PartitionedCall/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/convolution/ExpandDims_1", "shape": [1, 1024, 1, 513], "dtype": "float32"}, {"name": "PartitionedCall/transpose_2/perm", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_12/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_13/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/All", "shape": [], "dtype": "bool"}, {"name": "PartitionedCall/Const_2", "shape": [6], "dtype": "int32"}, {"name": "PartitionedCall/Const", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/Const_1", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_4", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Constant_6", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_8/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/transpose_4/perm", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/convolution_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/convolution_1/ExpandDims_1", "shape": [1, 1024, 1, 513], "dtype": "float32"}, {"name": "PartitionedCall/transpose_5/perm", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_14/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_15/perm", "shape": [4], "dtype": "int32"}, {"name": "unknown_4", "shape": [513, 128], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_22/perm", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/Const_7", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/clip_by_value/y", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_Div_26_recip", "shape": [], "dtype": "float32"}, {"name": "__inference_cond_false_42_62/cond/Shape", "shape": [3], "dtype": "int32"}, {"name": "__inference_cond_false_42_62/cond/range_1", "shape": [3], "dtype": "int32"}, {"name": "__inference_cond_false_42_62/cond/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "__inference_cond_false_42_62/cond/range", "shape": [3], "dtype": "int32"}, {"name": "__inference_cond_false_42_62/cond/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "__inference_cond_true_41_174/cond/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "__inference_cond_true_41_174/cond/transpose/perm", "shape": [2], "dtype": "int32"}]}]}