{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.2.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "66150"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1024"}, {"size": "1"}, {"size": "513"}]}}}}}, {"name": "PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_4/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_5/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/All", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "PartitionedCall/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_0/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution_1/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/convolution_1/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1024"}, {"size": "1"}, {"size": "513"}]}}}}}, {"name": "PartitionedCall/transpose_5/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_6/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_7/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "513"}, {"size": "128"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_14/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/Const_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_Div_18_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "66150"}]}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_0", "op": "ExpandDims", "input": ["input_1", "PartitionedCall/onnx_tf_prefix_Unsqueeze_0/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/cond", "op": "StatelessIf", "input": ["PartitionedCall/All", "PartitionedCall/Const", "PartitionedCall/onnx_tf_prefix_Unsqueeze_0"], "attr": {"Tout": {"list": {"type": ["DT_FLOAT"]}}, "_read_only_resource_inputs": {"list": {}}, "Tin": {"list": {"type": ["DT_INT32", "DT_FLOAT"]}}, "output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}]}]}}, "_lower_using_switch_merge": {"b": false}, "Tcond": {"type": "DT_BOOL"}, "then_branch": {"func": {"name": "__inference_cond_true_31_147"}}, "else_branch": {"func": {"name": "__inference_cond_false_32_33"}}}}, {"name": "PartitionedCall/transpose_1", "op": "Transpose", "input": ["PartitionedCall/cond", "PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_4", "op": "Transpose", "input": ["PartitionedCall/cond", "PartitionedCall/transpose_4/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/transpose_1", "PartitionedCall/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution_1/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/transpose_4", "PartitionedCall/convolution_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/convolution", "op": "Conv2D", "input": ["PartitionedCall/convolution/ExpandDims", "PartitionedCall/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "512", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/convolution_1", "op": "Conv2D", "input": ["PartitionedCall/convolution_1/ExpandDims", "PartitionedCall/convolution_1/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "512", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/convolution/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/convolution_1/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/convolution_1"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_2", "op": "Transpose", "input": ["PartitionedCall/convolution/Squeeze", "PartitionedCall/transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_5", "op": "Transpose", "input": ["PartitionedCall/convolution_1/Squeeze", "PartitionedCall/transpose_5/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_4", "op": "ExpandDims", "input": ["PartitionedCall/transpose_2", "PartitionedCall/onnx_tf_prefix_Unsqueeze_4/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_6", "op": "ExpandDims", "input": ["PartitionedCall/transpose_5", "PartitionedCall/onnx_tf_prefix_Unsqueeze_6/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_5", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_Unsqueeze_4", "PartitionedCall/onnx_tf_prefix_Transpose_5/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_7", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_Unsqueeze_6", "PartitionedCall/onnx_tf_prefix_Transpose_7/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Pow_8", "op": "Square", "input": ["PartitionedCall/onnx_tf_prefix_Transpose_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Pow_9", "op": "Square", "input": ["PartitionedCall/onnx_tf_prefix_Transpose_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Add_10", "op": "Add", "input": ["PartitionedCall/onnx_tf_prefix_Pow_8", "PartitionedCall/onnx_tf_prefix_Pow_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Squeeze_11", "op": "Squeeze", "input": ["PartitionedCall/onnx_tf_prefix_Add_10"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Squeeze_12", "op": "Squeeze", "input": ["PartitionedCall/onnx_tf_prefix_Squeeze_11"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {}}}}, {"name": "PartitionedCall/onnx_tf_prefix_MatMul_13", "op": "BatchMatMulV2", "input": ["PartitionedCall/onnx_tf_prefix_Squeeze_12", "unknown_3"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_14", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_MatMul_13", "PartitionedCall/onnx_tf_prefix_Transpose_14/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Max", "op": "Max", "input": ["PartitionedCall/onnx_tf_prefix_Transpose_14", "PartitionedCall/Const_5"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/clip_by_value/Minimum", "op": "Minimum", "input": ["PartitionedCall/onnx_tf_prefix_Transpose_14", "PartitionedCall/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/clip_by_value", "op": "Maximum", "input": ["PartitionedCall/clip_by_value/Minimum", "PartitionedCall/clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Log_16", "op": "Log", "input": ["PartitionedCall/clip_by_value"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Div_18", "op": "Mul", "input": ["PartitionedCall/onnx_tf_prefix_Log_16", "ConstantFolding/PartitionedCall/onnx_tf_prefix_Div_18_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_Div_18"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_cond_true_31_147", "inputArg": [{"name": "cond_reshape_const", "type": "DT_INT32"}, {"name": "cond_onnx_tf_prefix_pad_1_onnx_tf_prefix_unsqueeze_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "cond_identity", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_cond_true_31_147/cond/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_cond_true_31_147/cond/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "cond/Reshape", "op": "Reshape", "input": ["cond_reshape_const", "__inference_cond_true_31_147/cond/Reshape/shape:output:0"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "cond/transpose", "op": "Transpose", "input": ["cond/Reshape:output:0", "__inference_cond_true_31_147/cond/transpose/perm:output:0"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "cond/onnx_tf_prefix_Pad_1", "op": "MirrorPad", "input": ["cond_onnx_tf_prefix_pad_1_onnx_tf_prefix_unsqueeze_0", "cond/transpose:y:0"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}], "ret": {"cond_identity": "cond/onnx_tf_prefix_Pad_1:output:0"}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "1"}, {"size": "66150"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "6"}]}]}}}}}}, {"signature": {"name": "__inference_cond_false_32_33", "inputArg": [{"name": "cond_gatherv2_const", "type": "DT_INT32"}, {"name": "cond_slice_onnx_tf_prefix_unsqueeze_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "cond_identity", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_cond_false_32_33/cond/Shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "__inference_cond_false_32_33/cond/range_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "__inference_cond_false_32_33/cond/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_cond_false_32_33/cond/range", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "__inference_cond_false_32_33/cond/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "cond/GatherV2_1", "op": "GatherV2", "input": ["cond_gatherv2_const", "__inference_cond_false_32_33/cond/range_1:output:0", "__inference_cond_false_32_33/cond/GatherV2_1/axis:output:0"], "attr": {"Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "cond/GatherV2", "op": "GatherV2", "input": ["cond_gatherv2_const", "__inference_cond_false_32_33/cond/range:output:0", "__inference_cond_false_32_33/cond/GatherV2/axis:output:0"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "cond/add", "op": "AddV2", "input": ["__inference_cond_false_32_33/cond/Shape:output:0", "cond/GatherV2_1:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "cond/Neg", "op": "Neg", "input": ["cond/GatherV2:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "cond/sub", "op": "AddV2", "input": ["cond/add:z:0", "cond/GatherV2:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "cond/Slice", "op": "Slice", "input": ["cond_slice_onnx_tf_prefix_unsqueeze_0", "cond/Neg:y:0", "cond/sub:z:0"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}], "ret": {"cond_identity": "cond/Slice:output:0"}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "1"}, {"size": "66150"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "6"}]}]}}}}}}]}, "versions": {"producer": 561, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "PartitionedCall/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/convolution/ExpandDims_1", "shape": [1, 1024, 1, 513], "dtype": "float32"}, {"name": "PartitionedCall/transpose_2/perm", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_4/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_5/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/All", "shape": [], "dtype": "bool"}, {"name": "PartitionedCall/Const", "shape": [6], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_0/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/transpose_4/perm", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/convolution_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/convolution_1/ExpandDims_1", "shape": [1, 1024, 1, 513], "dtype": "float32"}, {"name": "PartitionedCall/transpose_5/perm", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_6/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_7/perm", "shape": [4], "dtype": "int32"}, {"name": "unknown_3", "shape": [513, 128], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Transpose_14/perm", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/Const_5", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/clip_by_value/y", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_Div_18_recip", "shape": [], "dtype": "float32"}, {"name": "__inference_cond_true_31_147/cond/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "__inference_cond_true_31_147/cond/transpose/perm", "shape": [2], "dtype": "int32"}, {"name": "__inference_cond_false_32_33/cond/Shape", "shape": [3], "dtype": "int32"}, {"name": "__inference_cond_false_32_33/cond/range_1", "shape": [3], "dtype": "int32"}, {"name": "__inference_cond_false_32_33/cond/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "__inference_cond_false_32_33/cond/range", "shape": [3], "dtype": "int32"}, {"name": "__inference_cond_false_32_33/cond/GatherV2/axis", "shape": [], "dtype": "int32"}]}]}