{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.2.0", "signature": {"inputs": {"unknown_0:0": {"name": "unknown_0:0", "dtype": "DT_INT64", "tensorShape": {}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "modelTopology": {"node": [{"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "32"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Gather_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_0/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Concat_3/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1312"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "PartitionedCall/transpose_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_8/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/ones", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "unknown", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1280"}]}}}}, {"name": "unknown_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_0", "op": "ExpandDims", "input": ["unknown", "PartitionedCall/onnx_tf_prefix_Unsqueeze_0/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_1", "op": "ExpandDims", "input": ["unknown_0", "PartitionedCall/onnx_tf_prefix_Unsqueeze_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Gather_2", "op": "GatherV2", "input": ["unknown_1", "PartitionedCall/onnx_tf_prefix_Unsqueeze_1", "PartitionedCall/onnx_tf_prefix_Gather_2/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Concat_3", "op": "ConcatV2", "input": ["PartitionedCall/onnx_tf_prefix_Gather_2", "PartitionedCall/onnx_tf_prefix_Unsqueeze_0", "PartitionedCall/onnx_tf_prefix_Concat_3/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/flatten/Reshape", "op": "Reshape", "input": ["PartitionedCall/onnx_tf_prefix_Concat_3", "PartitionedCall/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul", "op": "MatMul", "input": ["PartitionedCall/flatten/Reshape", "PartitionedCall/transpose"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/MatMul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Relu_5", "op": "Relu", "input": ["PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul_1", "op": "MatMul", "input": ["PartitionedCall/onnx_tf_prefix_Relu_5", "PartitionedCall/transpose_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "PartitionedCall/add_1", "op": "AddV2", "input": ["PartitionedCall/MatMul_1", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Squeeze_7", "op": "Squeeze", "input": ["PartitionedCall/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {}}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_8/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["PartitionedCall/onnx_tf_prefix_Squeeze_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_8/Sum", "op": "Sum", "input": ["PartitionedCall/onnx_tf_prefix_ReduceL2_8/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "PartitionedCall/onnx_tf_prefix_ReduceL2_8/Sum/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_8/Sqrt", "op": "Sqrt", "input": ["PartitionedCall/onnx_tf_prefix_ReduceL2_8/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Max", "op": "Max", "input": ["PartitionedCall/onnx_tf_prefix_ReduceL2_8/Sqrt", "PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/clip_by_value/Minimum", "op": "Minimum", "input": ["PartitionedCall/onnx_tf_prefix_ReduceL2_8/Sqrt", "PartitionedCall/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/clip_by_value", "op": "Maximum", "input": ["PartitionedCall/clip_by_value/Minimum", "PartitionedCall/clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_4", "op": "Mul", "input": ["PartitionedCall/clip_by_value", "PartitionedCall/ones"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Div_12", "op": "RealDiv", "input": ["PartitionedCall/onnx_tf_prefix_Squeeze_7", "PartitionedCall/mul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_Div_12"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown_1", "shape": [5, 32], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_1/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Gather_2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Unsqueeze_0/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Concat_3/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/transpose", "shape": [1312, 512], "dtype": "float32"}, {"name": "PartitionedCall/mul_1", "shape": [512], "dtype": "float32"}, {"name": "PartitionedCall/transpose_1", "shape": [512, 128], "dtype": "float32"}, {"name": "PartitionedCall/mul_3", "shape": [128], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_8/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/Const_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/clip_by_value/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/ones", "shape": [128], "dtype": "float32"}]}]}